---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures
source: html/8723c1e0-eaf2-e75e-51ea-28a4116f161f.htm
---
# BuiltInFailures.ExternalResourceReferenceFailures Properties

The External Resource refers to a local file that may not be available to workshared users.